Revit 2027 API
SweptBlend.PathSketch Property
The sketched path for the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Sketch PathSketch { get; }
Public ReadOnly Property PathSketch As Sketch
	Get
public:
property Sketch^ PathSketch {
	Sketch^ get ();
}
member PathSketch : Sketch with get
Property Value
Sketch
Remarks
If the swept blend is based on selected 3d curve, this property is null.
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace